In [ ]:
import pandas as pd
import numpy as np

In [ ]:
sales = pd.read_csv('/content/WA_Sales_Products_2012-14.csv')
sales.head()

  Retailer country Order method type  ... Quantity Gross margin
0    United States               Fax  ...      489     0.347548
1    United States               Fax  ...      252     0.474274
2    United States               Fax  ...      147     0.352772
3    United States               Fax  ...      303     0.282938
4    United States               Fax  ...     1415     0.291450

[5 rows x 11 columns]

In [ ]:
sales.pivot_table(index='Retailer country', columns='Year', values='Revenue', aggfunc='sum').head()

Year                     2012         2013         2014
Retailer country
Australia         25607043.50  47799737.14  35893188.50
Austria           34568089.63  44996737.04  33801788.98
Belgium           30396297.49  38375432.68  28186839.74
Brazil            34234876.30  43389953.66  31440841.48
Canada            75428386.09  98134069.39  73325209.39

In [ ]:
pt = sales.pivot_table(index='Retailer country', columns='Year', values='Revenue', aggfunc='sum')
pt.head()

Year                     2012         2013         2014
Retailer country
Australia         25607043.50  47799737.14  35893188.50
Austria           34568089.63  44996737.04  33801788.98
Belgium           30396297.49  38375432.68  28186839.74
Brazil            34234876.30  43389953.66  31440841.48
Canada            75428386.09  98134069.39  73325209.39

In [ ]:
pt.reset_index(inplace=True)
pt.head()

Year Retailer country         2012         2013         2014
0           Australia  25607043.50  47799737.14  35893188.50
1             Austria  34568089.63  44996737.04  33801788.98
2             Belgium  30396297.49  38375432.68  28186839.74
3              Brazil  34234876.30  43389953.66  31440841.48
4              Canada  75428386.09  98134069.39  73325209.39

In [ ]:
pt.fillna(0, inplace=True)
pt.head()

Year Retailer country         2012         2013         2014
0           Australia  25607043.50  47799737.14  35893188.50
1             Austria  34568089.63  44996737.04  33801788.98
2             Belgium  30396297.49  38375432.68  28186839.74
3              Brazil  34234876.30  43389953.66  31440841.48
4              Canada  75428386.09  98134069.39  73325209.39

In [ ]:
pt.melt(id_vars='Retailer country', value_name='RevenueSum', var_name='YearOfTransaction', value_vars=[2013,2014]).head()

  Retailer country YearOfTransaction   RevenueSum
0        Australia              2013  47799737.14
1          Austria              2013  44996737.04
2          Belgium              2013  38375432.68
3           Brazil              2013  43389953.66
4           Canada              2013  98134069.39

In [ ]:
pt = sales.pivot_table(index='Retailer country', columns='Year', values='Revenue', aggfunc='sum')
pt.head()

Year                     2012         2013         2014
Retailer country
Australia         25607043.50  47799737.14  35893188.50
Austria           34568089.63  44996737.04  33801788.98
Belgium           30396297.49  38375432.68  28186839.74
Brazil            34234876.30  43389953.66  31440841.48
Canada            75428386.09  98134069.39  73325209.39

In [ ]:
upvt = pt.unstack().to_frame().swaplevel().head()
upvt.columns=['RevenueSum']
upvt.head()

                        RevenueSum
Retailer country Year
Australia        2012  25607043.50
Austria          2012  34568089.63
Belgium          2012  30396297.49
Brazil           2012  34234876.30
Canada           2012  75428386.09